In [386]:
import pandas as pd
import numpy as np

In [387]:
data = pd.read_csv("data/data.csv")

In [388]:
df = pd.DataFrame(data)
df
df.index.name = "ID"

In [389]:
df.head()

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
ID,,,,,,,,,,
0,2021,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,"757,504",ANZSIC06 divisions A-S (excluding classes K633...
1,2021,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,"674,890",ANZSIC06 divisions A-S (excluding classes K633...
2,2021,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,"49,593",ANZSIC06 divisions A-S (excluding classes K633...
3,2021,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,"33,020",ANZSIC06 divisions A-S (excluding classes K633...
4,2021,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,"654,404",ANZSIC06 divisions A-S (excluding classes K633...

In [390]:
df.shape

(41715, 10)

In [391]:
df.size

417150

In [392]:
df.dtypes

Year                            int64
Industry_aggregation_NZSIOC    object
Industry_code_NZSIOC           object
Industry_name_NZSIOC           object
Units                          object
Variable_code                  object
Variable_name                  object
Variable_category              object
Value                          object
Industry_code_ANZSIC06         object
dtype: object

In [393]:
df = pd.DataFrame(data, columns=('Year','Industry_aggregation_NZSIOC','Industry_code_NZSIOC','Units'))
df.head(6)

    Year Industry_aggregation_NZSIOC Industry_code_NZSIOC               Units
ID
0   2021                     Level 1                99999  Dollars (millions)
1   2021                     Level 1                99999  Dollars (millions)
2   2021                     Level 1                99999  Dollars (millions)
3   2021                     Level 1                99999  Dollars (millions)
4   2021                     Level 1                99999  Dollars (millions)
5   2021                     Level 1                99999  Dollars (millions)

In [394]:
YR = df.Year.head(6)
YR

ID
0    2021
1    2021
2    2021
3    2021
4    2021
5    2021
Name: Year, dtype: int64

In [395]:
IAN = df["Industry_aggregation_NZSIOC"].head(6)
IAN

ID
0    Level 1
1    Level 1
2    Level 1
3    Level 1
4    Level 1
5    Level 1
Name: Industry_aggregation_NZSIOC, dtype: object

In [396]:
type(IAN)

pandas.core.series.Series

In [397]:
df = pd.DataFrame(data, columns=("Year", "Units", "Doller"))
df.head(6)

    Year               Units  Doller
ID
0   2021  Dollars (millions)     NaN
1   2021  Dollars (millions)     NaN
2   2021  Dollars (millions)     NaN
3   2021  Dollars (millions)     NaN
4   2021  Dollars (millions)     NaN
5   2021  Dollars (millions)     NaN

In [398]:
df.Doller = 0

In [399]:
change_val = pd.Series([125, 115, 512, 212, 121,4545], index=[0, 1, 2, 3, 4, 5])

In [400]:
df.Doller = change_val

In [401]:
df.head(6)

    Year               Units  Doller
ID
0   2021  Dollars (millions)   125.0
1   2021  Dollars (millions)   115.0
2   2021  Dollars (millions)   512.0
3   2021  Dollars (millions)   212.0
4   2021  Dollars (millions)   121.0
5   2021  Dollars (millions)  4545.0

In [402]:
df['200 +'] = df.Doller > 200

In [403]:
df.head(6)

    Year               Units  Doller  200 +
ID
0   2021  Dollars (millions)   125.0  False
1   2021  Dollars (millions)   115.0  False
2   2021  Dollars (millions)   512.0   True
3   2021  Dollars (millions)   212.0   True
4   2021  Dollars (millions)   121.0  False
5   2021  Dollars (millions)  4545.0   True

In [404]:
del df['200 +']

In [405]:
df.head(6)

    Year               Units  Doller
ID
0   2021  Dollars (millions)   125.0
1   2021  Dollars (millions)   115.0
2   2021  Dollars (millions)   512.0
3   2021  Dollars (millions)   212.0
4   2021  Dollars (millions)   121.0
5   2021  Dollars (millions)  4545.0

In [406]:
df.T

ID,0,1,2,3,4,5,6,7,8,9,...,41705,41706,41707,41708,41709,41710,41711,41712,41713,41714
Year,2021,2021,2021,2021,2021,2021,2021,2021,2021,2021,...,2013,2013,2013,2013,2013,2013,2013,2013,2013,2013
Units,Dollars (millions),Dollars (millions),Dollars (millions),Dollars (millions),Dollars (millions),Dollars (millions),Dollars (millions),Dollars (millions),Dollars (millions),Dollars (millions),...,Dollars (millions),Dollars (millions),Dollars,Dollars,Percentage,Percentage,Percentage,Percentage,Percentage,Percentage
Doller,125.0,115.0,512.0,212.0,121.0,4545.0,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [407]:
df.values

array([[2021, 'Dollars (millions)', 125.0],
       [2021, 'Dollars (millions)', 115.0],
       [2021, 'Dollars (millions)', 512.0],
       ...,
       [2013, 'Percentage', nan],
       [2013, 'Percentage', nan],
       [2013, 'Percentage', nan]], dtype=object)

In [408]:
df.head(6)

    Year               Units  Doller
ID
0   2021  Dollars (millions)   125.0
1   2021  Dollars (millions)   115.0
2   2021  Dollars (millions)   512.0
3   2021  Dollars (millions)   212.0
4   2021  Dollars (millions)   121.0
5   2021  Dollars (millions)  4545.0

In [409]:
df.to_csv('data_sort/output.csv', index=False)